/*************************************************************************
	> File Name: hw_5_23.c
	> Author: RunRui_Li
	> Mail: 770486267@qq.com 
	> Created Time: Mon 28 May 2018 06:48:05 PM CST
 ************************************************************************/

/**
 * 5.23 三元组顺序表的一种变型是，从三元组顺序表中去掉行下标域得到二元组顺序表，另设一个行起始向量，其每个分量是二元组顺序表的一个下标值，指示该行中第一个非零元素在二元组顺序表中的起始位置。试编写一个算法，由矩阵元素的下标值i，j求矩阵元素。试讨论这种方法和三元组顺序表相比有什么优缺点。
 */

//见../src/RLSparseMatrix.c中的GetDataRLSMatrix(RLMatrix M,int i,int l,ElemType *e);
